laRhea BL
                          laRhea BL
Speed Mix                 laRhea V+
                          place
your cup                      switching on...
please wait         preselection
-   Sugar    +         place
your cup                      remove cup
Please                   preparing
drink nr. §1              §1
preparing                        insert
exact change                 check coffee
brewer                 Programming
OK                      Error during
programming            1= KEY ---> VMC
2= VMC ---> KEY     Programming
EPROM data              Programming-----
RHEA FLASH------   product reserve
§1                  WATER FILTER
CLEAN.  10=START       machine
ready                       Service
Card                        Not available
                      reset coffee
grounds=RESET          reset coffee
grounds = P1            
                                  Credit:
§1                          Out of service
water filter         service
clean  brewer               Price :    §1
                      Out of service
coffee grounds       no  product
                        refilling water
wait                wait
                               wait
temperature                    Не рабoти
ИЗКЛ. §1 §2               machine off
§1:§2                   ................
start at:  §1:§2   TEST VEND
                          take a moment
to relax              Fresh
Milk                          messaggio 3
programmabile           enjoy a break
                      Always
at your service              insert coins
                       t. inst.     §1
----------------    t.c §1  t.s §2
t.h §3               Card Reader
Not Connected           DATA AUDIT
PLEASE  WAIT             J U G
                              rheavendors
                        place
your cup                      no  selections
F.Milk   OFF §1      HAPPY
HOUR                          FREE VEND
§1                        no coffee beans
OFF §1              mes 48
                             Out of service
no water             fill water and
press button -1-     Hydrodynamic
Emptying phase         automatic
steam rinsing             SERVICE
                            error  on KEY
code  §1              1-4=Mix 5=MilkMd
7=Gr 8=BC 9=Desc   1-4=Rinse
7=Gr 8=BC 9=Desc          1-4=Rinse 5=Milk
7=grinder 8=BC     1-4=Rinse
8=BC                      1-4=Rinse
                          rinsing   §1
§2                     RFID reader card
connected          Hello      §1
§2-§3-§4 §5 §6:§7     Enter the exact
amount              change
water filter                 clean
brewer                        empty
coffee grounds                SET  PRODUKT
---- OK ----           INSTALLATION
                       end
installation                    credit = 0
                         place the
card                      SELECTION CARD
                     product reserve
REFILL COFFEE       Not available
§1                    -  S U G A R   +
                   make a
selection                    door  module
vers. §1               espresso module
vers. §1            Milk module
version    §1           Periodic rinse
in §1 seconds         
OFF §1  §2                        Remove Cup
Please                   wait charging
steam boiler          invalid customer
card code          invalid machine
card code           lucky
selection                     TOKEN
                              wait please
steam temperat.         Price :    §1
Credit: §2            First coffee
in progress            emptying
coffee grounds             remove
driptray                     insert
driptray                     steam flushing
10=START             fill detergent
10=START             filling water...
conduc.=§1 uS      fill water
10=START                 warm water
flush.  10=START         Milk Module
switching on...         Milk container
empty                S T O P
                            RFID Card
Blocked                   Milk  Module
Please clean           clean with
deterg. 10=START         Cyclic Test
round #§1               Cyclic Test
Stopped!!!              rinse with cold
water   10=START    END Cleaning
with Detergent         END
steam flushing                  wait milk
unit cleaning             Place Cup
please                    setting grinder
Please wait         §1
HOT WATER                        Warning products
level   low         
                                  Catch Coffee
Push PROG Button        
autom. reset                      End
uninstall                       Final Result:§1
KEY PRESS <PROG>    Cleaning  Time
Milker Updated       TEST RUNNING
                       confirm partial
reset  press P10    Starting Test
4=start PROG=end      TEST MOTOR - §1
sx §2  dx §3        TEST - §1  Tp: §2
up §3  dn §4      Final Result
TEST - §1              System halted
Please restart!       Empty the waste
liquid tank         Insert the waste
liquid tank        rinsing §1   §2
........uS=§3       Have you done
checks?>START/10      Clean.Deter.type
10=Tab 12=Liquid   check milk
                         Check Detergent
of the water mix    Milk Mod.Clean.:
check deter. §1    Cleaning §1  §2
........uS=§3       Dissolving
Detergent §1 §2          Insert the milk
tube.10:now 9:no    Ins. Tube/refill
Milk 10:now 9:no   check milk
presence                 check milk
quality                  check milk and
make cleaning        Gest. rhMM1.v+ ?
B1=Enable B2=no    Clean. rhMM1.v+
Time §1:§2 Ok=P1    Milk Mod.Clean.:
low deterg. §1     check tank cold
milk temperature    Available
                          Close  Coffee
KEY PRESS <PROG>      Open   Coffee
KEY PRESS <PROG>      1/13 Clean Grin.
1=Grin1; 2=Grin2   2/13 G§1 Close
shutter.  10=ok      3/13 Rem. brewer
& bean hop 10=ok   4/13 Inst. clean
device.    10=ok   5/13 Grinder
clean   10=start       Cycle §1 of §2
                     6/13 Rep. Clean
10=YES; other=NO    7/13 Ref. Clean
device.    10=ok    8/13 Put back
bean hop.  10=ok      9/13 Open hopp.
shutter.  10=ok     10/13 Coffee
grind.  10=Start       Cycle §1 of §2
timeout §3 sec       11/13 Rep. Proc.
10=YES; other=NO   12/13 Put back
Brewer.  10 = ok     13/13 Coffee?
10=Yes; other=NO      ESPRESSO
preparing                  Forthcoming
sched maintenan.        Maintenance must
be performed       Enter Weight
1 = Save  §1           remove cup
Please                   Out of service
no water             Place your cup
and close flap       remove
driptray                     insert
driptray                     Please close the
flap               Milk  Module
Please clean           place
your cup                      insert
exact change                 check coffee
brewer                 service
clean  brewer               ................
start at:  §1:§2   TEST VEND
                          take a moment
to relax              Fresh
Milk                          messaggio 3
programmabile           enjoy a break
                      Always
at your service              insert coins
                       clean
brewer                        empty
coffee grounds                END PROGRAMMING
wait..........      access code
INHIBITED               uninstallation
in progress...        
                                  CALIBRATION IS
NOT POSSIBLE         Remove Brewer
Push PROG button      Replace Brewer
Push PROG Button     Open boiler tap
10=start            KEY PRESS
>PROG<                    end uninstall
close boiler tap      Water supply
conn.? Start=10        driptray
inside? 10=START           driptray
inside? 10=START           remove coffee
grounds 10=START      Drip tray
empty? Start=10           REGISTRATION out
of service         REGISTRATION out
of service         PROGRAMMING-----
----------------   Preselection
not used               PRODUCT  §1
0=inhib.    §2.§3       coffee time
grinder §1   §2.§3      coffee time
grinder     §1.§2       Ent. Weight §1
1=Save  2=Repeat     Ent. ML of water
1=Save 2=rep §1    Empties test jug
Test:  1=ok 2=no   Fill H2O FM tank
t.tube 1=ok 2=no   Confirm Action
10=YES      9=NO     1-4=Mix 5=MilkMd
8=BC 9=Desc        1-4=Rinse
8=BC 9=Desc               1-4=Rinse 5=Milk
8=BC               1-4=Rinse
7=grinder 8=BC            1-4=Mx M:5=C 6=D
7=Gr 8=BC 9=Desc   1-4=Mix 5=MilkMd
6=DeM 8=BC 9=Des   1-4=Mix 5=MilkMd
6=D.M 7=Gr. 8=BC   1-4=Mix 5=MilkMd
6=Desc.Milk 8=BC   ПЕСТЕНЕ ЕНЕРГИЯ
                    Credit:
кредитна карта              Моля дръжте
кредитната карта        Калибр. мелачка
необходимо          Refill   cups
                      Use own cups
                       